app/views/subjects/list.html.erb

SELECT COUNT(*) FROM `subjects`
SELECT `subjects`.* FROM `subjects` ORDER BY subjects.position ASC
---
<%= link_to("new subject", {:action => 'new'}, :class => 'action new') %>
<div><%= pluralize(@subjects.size, 'subject') %> found</div>