app/controllers/pages_controller.rb

  def list
    @pages = Page.order("pages.posistion ASC")
---
SELECT `pages`.* FROM `pages` ORDER BY pages.posistion ASC

  def create
    # Instantiate a new object using form parameters
    @page = Page.new(params[:page])
    # Save the object
    if @page.save
---
INSERT INTO `pages` (`created_at`, `name`, `permalink`, `posistion`, `subject_id`, `updated_at`, `visible`) VALUES ('2012-03-19 17:04:20', 'Daniel', '0', 2, 2, '2012-03-19 17:04:20', 1)

  def edit
    @page = Page.find(params[:id])
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 3 LIMIT 1

  def delete
    @page = Page.find(params[:id])
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 3 LIMIT 1

  def destroy
    Page.find(params[:id]).destroy
---
DELETE FROM `pages` WHERE `pages`.`id` = 3
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 3 LIMIT 1