app/controllers/subjects_controller.rb

SELECT `subjects`.* FROM `subjects` ORDER BY subjects.position ASC
---
	def list
	   @subjects =  Subject.order("subjects.position ASC")

SELECT COUNT(*) FROM `subjects`
---
	def new
	   @subject = Subject.new(:name => 'default')
	   @subject_count = Subject.count + 1

INSERT INTO `subjects` (`created_at`, `name`, `position`, `updated_at`, `visible`) VALUES ('2012-02-22 14:54:05', 'Test subject', 11, '2012-02-22 14:54:05', 0)
SELECT COUNT(*) FROM `subjects`
---
	def create
		@subject = Subject.new(params[:subject])
		if @subject.save
			flash[:notice] = "Subject saved!"
			redirect_to(:action => 'list')
		else
			@subject_count = Subject.count + 1

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 7 LIMIT 1
SELECT COUNT(*) FROM `subjects`
---
	def edit
    		@subject = Subject.find(params[:id])
		@subject_count = Subject.count

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 7 LIMIT 1
UPDATE `subjects` SET `position` = 13, `updated_at` = '2012-02-28 21:45:37' WHERE `subjects`.`id` = 7
---
	def update
  		  # Find object using form parameters
  		  @subject = Subject.find(params[:id])
   		  # Update the object
   			 if @subject.update_attributes(params[:subject])

DELETE FROM `subjects` WHERE `subjects`.`id` = 3
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 3 LIMIT 1
---
  	def destroy
		flash[:notice] = "Subject destroyed!"
    		Subject.find(params[:id]).destroy